In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
ser1 = Series([0,1,2],index = list('abc'))

In [3]:
ser1

a    0
b    1
c    2
dtype: int64

In [5]:
ser2 = Series([3,4,5,6,7],index=list('abcde'))

In [6]:
ser2

a    3
b    4
c    5
d    6
e    7
dtype: int64

In [7]:
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
e    NaN
dtype: float64

In [14]:
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('ab'),index=['NYE','LA'])

In [15]:
dframe1

     a  b
NYE  0  1
LA   2  3

In [16]:
dframe = DataFrame(np.arange(9).reshape(3,3),columns=list('adc'),index=['NYE','SF','LA'])

In [17]:
dframe

     a  d  c
NYE  0  1  2
SF   3  4  5
LA   6  7  8

In [18]:
dframe+dframe1

       a   b   c   d
LA   8.0 NaN NaN NaN
NYE  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [19]:
dframe1.add(dframe,fill_value=0)

       a    b    c    d
LA   8.0  3.0  8.0  7.0
NYE  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [21]:
ser3=dframe.iloc[0]

In [22]:
ser3

a    0
d    1
c    2
Name: NYE, dtype: int32

In [26]:
dframe-ser3

     a  d  c
NYE  0  0  0
SF   3  3  3
LA   6  6  6